{"pageProps":{"post":{"title":"The Good and Bad Parts of JS (according to Douglas Crockford)","date":"2019-12-30T14:50:07.322Z","slug":"good_parts_crockford","author":{"name":"Jamie Vaughn","picture":"/authors/jj.jpeg"},"content":"<p>Javascript, having famously been created in ten days, has some weird parts. Some of the baggage is from being around for so long and from being a creation of the ECMAScript TC39 committee. Despite all of that, it is still a great language with a lot of power and expressiveness. Douglas Crockford contends the detractors of Javascript mainly get frustrated with the language because they approach it from an Object Oriented angle instead of a Functional angle (it is based on Scheme after all, a 1970's FP language). This is by no means exhaustive, but here are some notes on What Crockford considers good (and bad) about JS:</p>\n<h2>The Good Parts</h2>\n<h3>First Class Functions or Higher Order Functions</h3>\n<p>Functions in JS can take functions as parameters and return functions as values. Javascript has always had this (that's why I list it separately), as it was an adopted feature from Scheme. This permits powerful Currying, Closure patterns and the Continuation Passing Style.</p>\n<h3>Good Parts from ES6+</h3>\n<ol>\n<li>Proper Tail Calls for Recursive Function optimization</li>\n</ol>\n<pre><code class=\"language-js\">// The bad way:\nfunction repeat(func) {\n  while (func() !== undefined) {\n    repeat(func);\n  }\n}\n// Proper Tail Call way:\nfunction repeat(func) {\n  if (func() !== undefined) {\n    return repeat(func);\n  }\n}\n</code></pre>\n<p>The second example enjoys a performance boost by using less memory due to the Tail call. Proper Tail Calls (i.e. tail call optimization) is simply when the last line of your function returns the self-invoked function. The optimization is from the stack frame to remove old function stack traces and replace it with the newly invoked trace, so there isn't a memory overflow threat.</p>\n<ol start=\"2\">\n<li>The Spread and Rest Operator <code>[...array]</code></li>\n<li>The Module System</li>\n<li><code>let</code> and <code>const</code></li>\n<li>Destructuring allows for easy RORO (receive object, return object) design patterns</li>\n<li>Improved Object looping: <code>Object.keys.forEach()</code></li>\n<li>WeakMap(): Works how Objects should have worked from the start with auto-garbage collection.</li>\n<li>Template String Literals (great for templating and breaking up regex)</li>\n</ol>\n<pre><code class=\"language-js\">`Hello ${name}`;\n</code></pre>\n<ol start=\"9\">\n<li>Arrow Functions (aka Lambdas): Great as callbacks/predicates</li>\n<li>The suitability towards the Functional programming style</li>\n</ol>\n<pre><code class=\"language-js\">// The JS way to do class-free OOP using Functions:\nfunction constructor(spec) {\n  let { member } = spec,\n    { other } = other_constructor(spec),\n    method = function () {\n      /* member, other, method, spec */\n    };\n  return Object.freeze({\n    method,\n    other,\n  });\n}\n</code></pre>\n<h2>The Bad Parts</h2>\n<h3>The Old</h3>\n<ol>\n<li>The <code>new</code> keyword (error-prone, prefer the literal syntax)</li>\n<li>Object.create (prefer literal syntax or Object.assign({}, source) to avoid pass by reference errors)</li>\n<li>The <code>this</code> keyword (error prone due to unintuitive value adoption)</li>\n<li>label breaks</li>\n<li>prototypes, prototypal inheritance (error prone due to confusion from Own vs. Inherited properties)\n<blockquote>\n<p>Note from the author: I disagree with Crockford on this point, I found prototypal inheritance to be much more intuitive than classical inheritance</p>\n</blockquote>\n</li>\n<li><code>null</code> (There should only be <code>undefined</code> or <code>null</code>, not both. Since <code>null</code> regrettably returns typeof as <code>object</code>, it ought to be the one removed)</li>\n<li>falsiness (Coercion in general due to unexpected values, but falsiness in particular trips up control flow quite often with values like <code>''</code> and <code>0</code>)</li>\n<li><code>for</code> loops and <code>for...in</code> loops (prefer the `.forEach() syntax)</li>\n<li><code>while</code> loops (prefer recursive functions with tail calls)</li>\n</ol>\n<h3>Bad Parts from ES6+</h3>\n<h4>Classes</h4>\n<p>This is only syntactic sugar over functions anyways and it does not change the prototypal inheritance model to the classical inheritance model, so it threatens to mislead OOP programmers about how properties are truly being inherited.</p>\n<h4>Generators</h4>\n<p>Crockford does not like these because he claims they are inherently &quot;stateful&quot; and cannot be pure functions (i.e. functions without side effects). Crockford feels that unaccounted for &quot;statefulness&quot; accounts for a large number of bugs/errors and so he prefers using pure functions whenever possible, and so dismisses generators since they are inherently impure.</p>\n<blockquote>\n<p>Note from the author: I somewhat disagree with Crockford's thoughts on this one: While generators <em>CAN</em> be stateful, they certainly do not have to be. It depends on how you author it. I do agree that generators cannot really be pure functions, but that is ok since they can serve as wrappers to other pure functions, which provide a nice Iterable interface for those pure functions. And having the control of an Iterator by default is a powerful interface for dealing with returned values.</p>\n</blockquote>\n<p>Overall I feel that I am in agreement with Crockford's opinions about which parts of Javascript to lean on and which parts to avoid. In particular, Javascript's origins from the Scheme language mean it is best used in the functional styleso it can take advantage of higher order functions, currying, closures, and recursion. And in general I agree about avoiding OOP patterns. Although, there is no need for fanatical avoidance of OOP, both FP and OOP can be used together to great effect.</p>\n<p>I mentioned the two places already where I disgree with Crockford on his thoughts here: Prototypes and Generators. I think both of these language features actually have tremendous strengths. This is largely due to lessons I've absorbed from another great JS teacher, Kyle Simpson. I will have a similar notes-dump post about <em>his</em> thoughts in the future.</p>\n","ogImage":{"url":"/img/cover.jpg"},"coverImage":"/img/cover.jpg"}},"__N_SSG":true}