{"pageProps":{"post":{"tags":["Javascript","Functional"],"title":"Lookup-Table Syntax Options in Javascript","date":"2020-07-20T08:50:00.322Z","slug":"lookup_tables","author":{"name":"Jamie Vaughn","picture":"/authors/jj.jpeg"},"content":"<p>Most event-based programming, whether it is for UI or not, needs a way to map some list of actions or inputs to blocks of logic to execute. Procedural Programming may not need this because the entire program is expected to run synchronously and in order. But when responding to events, code will not execute in a predictable order, which requires a good way to organize the possible blocks of logic that may need to run at these asynchronous times. The Asynchronicity, itself, is handled by other patterns (Promises, Futures, Observables Pub/Sub, etc.), but for organizing the callbacks of these patterns, lets take a look at some lookup-table implementation patterns. These patterns appear commonly in state management libraries like Redux and XState to manage state, dispatchers, and actions which may be triggered or transformed within a user interface.</p>\n<h2>A Few Options for Authoring Lookup-Tables in JS</h2>\n<ul>\n<li>If statements (conventional or ternary)</li>\n<li>Switch Statements</li>\n<li>Objects/Maps (Lookup-Tables)</li>\n</ul>\n<p>First we have the humble <code>if</code> statement control flow implementation in both conventional and ternary syntax:</p>\n<pre><code class=\"language-js\">function getSound(str) {\n  return test === &quot;cat&quot;\n    ? &quot;meow&quot;\n    : test === &quot;cow&quot;\n    ? &quot;moo&quot;\n    : test === &quot;dog&quot;\n    ? &quot;woof&quot;\n    : test === &quot;bird&quot;\n    ? &quot;chirp&quot;\n    : test === &quot;frog&quot;\n    ? &quot;ribit&quot;\n    : &quot;silence&quot;;\n}\n</code></pre>\n<p>Or the same logic but with conventional <code>if</code> / <code>else if</code> / <code>else</code> syntax:</p>\n<pre><code class=\"language-js\">function getSoundConv(str) {\n  if (str === &quot;cat&quot;) return &quot;meow&quot;;\n  else if (str === &quot;cow&quot;) return &quot;moo&quot;;\n  else if (str === &quot;dog&quot;) return &quot;woof&quot;;\n  else if (str === &quot;bird&quot;) return &quot;chirp&quot;;\n  else if (str === &quot;frog&quot;) return &quot;ribit&quot;;\n  else return &quot;silence&quot;;\n}\n</code></pre>\n<p>Control flow implementations necessarily introduce <a href=\"https://en.wikipedia.org/wiki/Cyclomatic_complexity\">cyclomatic complexity</a> meaning there is branching logic within one's code. This is considered somewhat of a code smell in the Functional Paradigm because it imposes a cost on code readability. The next two implementations avoid the control flow pattern and thus reduce cyclomatic complexity. They make it eaiser to map pieces of UI directly to blocks of logic, rather than routing multiple UI element events through one imperative block of logic that the control flow must untangle.</p>\n<p>The first of the &quot;non-control flow&quot; options is a lookup-table implemented via a <code>switch</code> statement:</p>\n<pre><code class=\"language-js\">function switchSound(str) {\n  switch (str) {\n    case &quot;cat&quot;:\n      return &quot;meow&quot;;\n    case &quot;dog&quot;:\n      return &quot;woof&quot;;\n    case &quot;cow&quot;:\n      return &quot;moo&quot;;\n    case &quot;bird&quot;:\n      return &quot;chirp&quot;;\n    case &quot;frog&quot;:\n      return &quot;ribit&quot;;\n    default:\n      return &quot;silence&quot;;\n  }\n}\n</code></pre>\n<p>And next we have an example of a lookup-table function using a simple object factory:</p>\n<pre><code class=\"language-js\">function factorySound(str) {\n  return (\n    {\n      cat: &quot;meow&quot;,\n      dog: &quot;woof&quot;,\n      cow: &quot;moo&quot;,\n      bird: &quot;chirp&quot;,\n      frog: &quot;ribit&quot;,\n    }[str] ?? &quot;silence&quot;\n  );\n}\n</code></pre>\n<p>The above implementation uses a factory function that returns plain JS objects, but would look about the same using a Map() or WeakMap(). An easy extra optimization that can be made with this approach is defining the object externally to the function in order to limit how many of these objects are created in memory. Then the function is simply a getter for that object, essentially.</p>\n<pre><code class=\"language-js\">// same obj as above just defined outside function.\nconst Animals = {cat: 'meow', ... }\nfunction factorySound(str) {\n  return Animals[str] ?? 'silence'\n}\n</code></pre>\n<p>Going this route suggests that the factorySound function could be abstracted to a general <code>factoryValue</code> function and could be used on any object that you define in your application:</p>\n<pre><code class=\"language-js\">function factoryValue(obj, str, default = 'silence') {\n  return obj[str] ?? default\n}\n</code></pre>\n<p>All four of the functions above will provide an easy API for retrieving values by passing in a simple enum.\nWe can test the functions with something simple to inspect their output and we would get something like this:</p>\n<pre><code class=\"language-js\">console.log(getSound(&quot;dog&quot;)); // 'woof'\nconsole.log(getSoundConv(&quot;cow&quot;)); // 'moo'\nconsole.log(switchSound(&quot;cat&quot;)); // 'meow'\nconsole.log(factorySound(&quot;snake&quot;)); // 'silence'\n</code></pre>\n<h3>Which to favor?</h3>\n<p>This is subjective as any of the styles work in the expected way. The decision of which to use comes down to two things, I think: (1) Readability and (2) Extensibility.</p>\n<p>In my opinion, both of the <code>if</code> statement styles are the least readable. The conventional <code>if</code> statement style would at least offer you better extensibility over the ternary style since you can more easily use multi-line code for more complex logic. But the extensibility is matched or exceeded by the switch and factory styles, so I think it's safe to lay the <code>if</code> statement style aside in favor of one of the next two styles.</p>\n<p>Between the <code>switch</code> style and the factory style, I think there is a fair argument to be made for both. The object factory style's advantage is that, as an object, it is quite literally a map or a key-value store. So it is the thing we set out to recreate, meaning what we see is what we want it to be and not some adaptation or hack. So in terms of readability, I'd give the edge to the oject factory table syntax.</p>\n<p>In terms of extensibility, both the <code>switch</code> and facotry styles permit multi-line space for complex execution logic. Both can be adapted to use a more declarative style over an imperative style by returning a function instead of executing procedural logic in place. The switch statement <code>case</code> block and the factory table allow convenient non-co-located function definitions to be mapped to the keys or <code>case</code> block without being invoked inline. So both permit easily passing function callbacks around our program for lazy execution and taking better advantage of closures. And both equally reduce cyclomatic complexity by mapping an enum directly to a block of logic, which reduces code branching unlike the <code>if</code> statements.</p>\n<p>Perhaps the key distinction is the <code>switch</code> statement has more flexibility than the factory table by not being constrained only to enums as the access API. The <code>switch</code> statement can also accomodate comparisons to map to execution blocks, which may suit one's program in particular situations. In most situations enums are prefered for readability and are usually good enough, but having the additional flexibility of comparators may explain why <code>switch</code> statements seem more popular in Reducer utilities, like React's <code>useReducer</code> and Redux, within the functional community.</p>\n<h3>Use Cases</h3>\n<p>A common use case for this pattern is for mapping blocks of code to execute for each UI element that triggers an event. A pitfall that leads to unnecessary cyclomatic complexity is relying on a single function as a callback when any one of an entire set of buttons is clicked. This callback would typically work out which code to execute within the function by using control flow to check either some background global state or checking some flag parameter that is passed in.</p>\n<p>The lookup-table pattern lets us separate out the logic of determining which code block to execute into its own structure (i.e. one of the lookup functions above). Then the return value from that lookup-table funciton would, ultimately, be the code block that needs to be executed as a result of the triggering event. Emerging from this pattern is that the control flow mentioned in the previous paragraph simply falls away if the UI is setup accordingly. The UI element can contain the enum value that will be passed in the event object that bubbles and the lookup-table can retrieve the correct function without any control flow using the event object properties. This is what is meant by &quot;pushing cyclomatic complexity out&quot;. The logic branching still technically exists in the program, but we've pushed it all the way into the UI layer (instead of it being in the business logic layer) which simplifies our code. Since the branch now implicitly occurs before the moment of user input, the branch logic never explicitly appears in the code itself.</p>\n<h5>An Example</h5>\n<p>Let's take a simple contrived example of a drop down menu:</p>\n<p>The HTML might be something like this:</p>\n<pre><code class=\"language-html\">&lt;label for=&quot;choices&quot;&gt;Listen to an animal's call:&lt;/label&gt;\n&lt;select id=&quot;choices&quot; onchange=&quot;factorySound(event.target.value)&quot;&gt;\n  &lt;option value=&quot;dog&quot;&gt;Dog&lt;/option&gt;\n  &lt;option value=&quot;cat&quot;&gt;Cat&lt;/option&gt;\n  &lt;option value=&quot;bird&quot;&gt;Bird/option&gt;&lt;/option&gt;\n  &lt;option value=&quot;cow&quot;&gt;Cow&lt;/option&gt;\n  &lt;option value=&quot;bear&quot;&gt;Bear&lt;/option&gt;\n&lt;/select&gt;\n\n&lt;img src=&quot;&quot; alt=&quot;animal&quot; id=&quot;selection&quot; /&gt;\n</code></pre>\n<p>And the javascript can use one of our lookup-tables from before, which you'll notice we can easily extend with a new <code>bear</code> field. We can also keep unused fields without consequence, like <code>frog</code>, which might be used in another UI component but won't be used in this one, and it will safely be inert here:</p>\n<pre><code class=\"language-js\">function factorySound(str) {\n  return (\n    {\n      cat: soundAction(str, &quot;meow&quot;),\n      dog: soundAction(str, &quot;woof&quot;),\n      cow: soundAction(str, &quot;moo&quot;),\n      bird: soundAction(str, &quot;chirp&quot;),\n      frog: soundAction(str, &quot;ribit&quot;),\n      bear: soundAction(str, &quot;roar&quot;),\n    }[str] ?? soundAction(str, &quot;silence&quot;)\n  );\n}\n\nfunction soundAction(str, sound) {\n  console.log(sound);\n  document\n    .querySelector(&quot;#selection&quot;)\n    .setAttribute(&quot;src&quot;, `https://pictureof${str}.com/200/300`);\n}\n</code></pre>\n<p>We've also added a new function called <code>soundAction</code>, which can be the composable function that holds the actual business logic code block that should be run upon the event being triggered. It can contain any arbitrary logic, and of course different functions can be mapped to different lookup-table fields as needed for customizability. In this example, the busines logic just logs the animal sound and populates an image of the animal from a hypothetical animal picture API.</p>\n<p>With this kind of organization (which resembles the formalized Command Pattern), you'll notice there are no if statements and no conventional control flow which means we keep our cyclomatic complexity to a minimum. We've pushed all of the logic branching up into the UI layer (which is as high as it can go) and we allow the event system itself to pass the information needed to run the correct code block.</p>\n","ogImage":{"url":"/img/cover.jpg"},"coverImage":"/img/cover.jpg"}},"__N_SSG":true}