{"pageProps":{"post":{"tags":["JavaScript"],"title":"Generating UUID's in the Browser","date":"2021-01-19T12:32:07.322Z","slug":"uuids","author":{"name":"Jamie Vaughn","picture":"/authors/jj.jpeg"},"content":"<p>Sometimes there is a need to generate an id for objects created in the browser. Simply using an index or a number generated from <code>Math.random()</code> does not ensure an adequate level of uniqueness. What is really needed is a Universally Unique IDentifier (UUID). A UUID is a special id that garauntees uniqueness across all space and time.</p>\n<blockquote>\n<p>A UUID is 128 bits long, and can guarantee uniqueness across space and time. UUIDs were originally used in the Apollo Network Computing System and later in the Open Software Foundation's (OSF) Distributed Computing Environment (DCE), and then in Microsoft Windows platforms.</p>\n</blockquote>\n<p><a href=\"https://tools.ietf.org/html/rfc4122\">source</a></p>\n<p>There is a specification for the File API in the browser that generates UUID's according to the above requirements which ensures universal uniqueness. The browsers use it when creating <code>blob</code> for naming URLs for file resource locations.</p>\n<p>It generates a URL that contains a UUID as part of the string as specificed in the File API spcification on <a href=\"https://w3c.github.io/FileAPI/#unicodeBlobURL\">step 9 of the procedure for generating a new blob URL</a>.</p>\n<blockquote>\n<p>An example of a blob URL that can be generated by this algorithm is blob:https://example.org/40a5fb5a-d56d-4a33-b4e2-0acf6a8e5f641.</p>\n</blockquote>\n<p>With a tiny bit of cleverness, we can leverage that feature ourselves to use it for generating UUIDs as IDs for our own objects. And it can be done with a very terse function as well!</p>\n<h2>First, Let's See It In Action!</h2>\n<p>Click the button to generate a UUID</p>\n<p>GenUUID</p>\n<h2>The Implementation</h2>\n<p>The implementation depends on instantiating a <code>new Blob()</code> and then passing that to the browser API <code>URL.createObjectURL()</code>. That will generate a url with a UUID in it, as seen previously. We can then use some string and array manipulation to extract out just the UUID from the URL.</p>\n<pre><code class=\"language-js\">// create the URL\nURL.createObjectURL(new Blob());\n// output: 'blob:https://example.org/40a5fb5a-d56d-4a33-b4e2-0acf6a8e5f641'\n</code></pre>\n<p>So to grab just the UUID from the end of that blob we can use the split method. If we split the string on the <code>/</code> character then it will always create an array of 4 elements with the element at position <code>3</code> containing the UUID that we are after:</p>\n<pre><code class=\"language-js\">URL.createObjectURL(new Blob()).split(&quot;/&quot;)[3];\n// output: '40a5fb5a-d56d-4a33-b4e2-0acf6a8e5f641'\n</code></pre>\n<p>To avoid memory leaks we will also want to be sure to call <code>URL.revokeObjectURL</code> and pass it a reference to the URL blob we created.</p>\n<p>Let's see how it looks packaged up into a reusable function:</p>\n<pre><code class=\"language-js\">const uuid = () =&gt; {\n  let url = URL.createObjectURL(new Blob());\n  URL.revokeObjectURL(url);\n  return url.split(&quot;/&quot;)[3];\n};\n</code></pre>\n<p>For fun, we could play some &quot;code golf&quot; with it and shorten that function up a bit more:</p>\n<pre><code class=\"language-js\">const uuid = (url = URL.createObjectURL(new Blob())) =&gt;\n  URL.revokeObjectURL(url) || url.split(&quot;/&quot;)[3];\n</code></pre>\n<p>Just make sure to invoke that function with no parameters passed so the default value is used for the <code>url</code> parameter. Also note that the <code>URL.createObjectURL</code> API is available in Web Workers (but not in Service Workers).</p>\n","ogImage":{"url":"/img/cover.jpg"},"coverImage":"/img/cover.jpg"}},"__N_SSG":true}