{"pageProps":{"post":{"title":"Javascript's Immutability Toolkit","date":"2020-12-21T12:35:07.322Z","slug":"immutability","author":{"name":"Jamie Vaughn","picture":"/authors/jj.jpeg"},"content":"<p>We'll survey the various methods available natively in JS that allow us to manipulate data without mutating it in place.</p>\n<p>In the functional programming paradigm, avoiding mutation of data or state in your application is an important prinicple that helps us to avoid a certain class of bugs related to side effects and state. Maintaining immutibility during data manipulation can help with:</p>\n<ul>\n<li>State management</li>\n<li>Pure Functions</li>\n<li>Race Conditions</li>\n<li>Developer Experience (DX)</li>\n</ul>\n<p>When mutating data in place, there is a strong risk that some other piece of the application is still depending on that data's previous state and may break due to that data mutating. By using immutable methods, you can simply make copies of the application state, applying the changes to that copy, and then pass the new copy to the funciton or method that needs to use it, without worrying about other parts of the application being affected by that change unknowingly.</p>\n<p>This immutability principle is preferred in the React community when creating internal component state and also when using Redux for managing global state.</p>\n<p>The only real downside is that it uses more memory... but memory isn't in short supply with today's hardware. And the improvement in the DX, by making state management more easily understandable far outweighs that downside, in my opinion.</p>\n<h2>Favor Non-Mutating Methods</h2>\n<p>Here is a list of JS arrays methods and a few other ways to manipulate data in a non-mutating way:</p>\n<pre><code class=\"language-js\">const arr = [1]\narr.slice() // prefer .slice over .splice and for general array copying\narr.flat()\narr.concat() // prefer .concat over .push\narr.map() // prefer .map over .forEach\narr.flatMap()\narr.filter()\narr.reduce()\narr.reduceRight()\narr.some()\narr.every()\narr.find()\narr.findIndex()\narr.join()\narr.toString()\n[...arr, 4, 5]\nObject.keys, .values. entries() // to manipulate Object as Array then convert back\nObject.assign({}, obj)\nObject.freeze()\n</code></pre>\n<p>Check MDN's <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/from#\">Array methods in the side bar on the left</a> for an exhaustive list.</p>\n<p>Pure functions are a central part of data immutability. Pure functions are the canonical black box that simply inputs something and returns some transformation of that input. Input, Output... no side effects. This also tends to keep the functions simple, which improves DX.\nA pure function:</p>\n<pre><code class=\"language-js\">function square(num) {\n  return num ** 2;\n}\n</code></pre>\n<p>Now, obviously for an application to be useful, it has to execute side effects at some point. The idea behind pure functions and immutability is to isolate those effectful parts of the program into as small a space as possible and ensure that the largest amount of the program abides by the immutability principles.</p>\n<h2>Avoid Mutating Methods</h2>\n<p>Let's briefly mention some of the common mutating methods in JS that you would be advised to avoid by default. There are, of course, circumstances in which these methods should be used, but they should not be the first choice, in general. Consider only using these methods in the isolated edges of your application into which you are segregating your side effects. They also may be needed as a last resort when immutability is not feasible.</p>\n<pre><code class=\"language-js\">arr.push();\narr.pop();\narr.shift();\narr.unshift();\narr.splice();\narr.sort(); // to adapt this to immutability, use .slice(0).sort() or [...arr].sort()\narr.reverse();\narr.copyWithin();\narr.forEach();\nObject.create(); // Mutating in the sense that it inherits prototype properties which can be overwritten\n</code></pre>\n<p>One note about <code>forEach()</code>: This is the prefered way in the functional paradigm to implement for loops that execute side effects. But for most cases that need loops, <code>map()</code>, <code>filter()</code> and <code>reduce()</code> are the preferred methods.</p>\n<h2>Object.freeze() &amp; const</h2>\n<p>To protect variables' mutability, JS now has the <code>const</code> keyword. a variable declared with <code>const</code> will be treated as a constant and it will not be able to be overwritten or re-declared. For imuutability reasons, we will want to prefer using <code>const</code> over using <code>let</code> or <code>var</code>. Of course, there will always be reasons to use <code>let</code> in cases that you must be able to re-declare a variable, and that's fine. And there will even be cases to use <code>var</code> for hoisting reasons, for example, and that is also fine. But in general, default to using <code>const</code> unless you find that you positively need one of the other two.</p>\n<p>One limitation of the <code>const</code> keyword is that it does not prevent overwritting of values in nested data structures like objects and arrays.</p>\n<pre><code class=\"language-js\">const myNum = 5;\nmyNum = 6; // Throws TypeError, myNum is protected from mutation\nconst myNum = 6; // Throws SyntaxError, myNum can't be re-declared/re-initialized\n\nconst myObj = {\n  num: 5,\n};\nmyObj = [6]; // Throws TypeError, myObj is protected from mutation\nmyObj.num = 6; // this is permitted, the properties within myObj are not protected\n</code></pre>\n<p>The way to protect neseted data in an object is to use <code>Object.freeze</code>. And since arrays are also objects, this can be used on arrays as well. Here's an example:</p>\n<pre><code class=\"language-js\">const myObj = {\n  num: 5,\n  nested: {\n    num: 1,\n  },\n};\nObject.freeze(myObj);\nmyObj.num = 6; // JS will silently ignore this, now the internal properties are also protected\nconsole.log(myObj.num); // 5\n\nconst myArr = [1, 2, [3, 4]];\nObject.freeze(myArr);\nmyArr[0] = 9; // JS will silently ignore this, now the internal values are also protected\n</code></pre>\n<p>Object.freeze has a serious limitation, though and that is that it only freezes an object shallowly:</p>\n<pre><code class=\"language-js\">myObj.nested.num = 9; // this will mutate that property form 1 to 9\nconsole.log(myObj.num); // 9\nmyArr[2][0] = 9; // this will mutate that property from 3 to 9\nconsole.log(myArr[2][0]); // 9\n</code></pre>\n<p>In other words, it only protects to the first level of nesting. So in order to protect all of an arbitrarily nested object or array, you'll have to use a loop or recursion to reach the inner nested objects and freeze each of those as well. This is referred to as a &quot;deep freeze.&quot; And rather than try to write your own algorithm to do it, you can use a small library such as <a href=\"https://github.com/substack/deep-freeze\">this one</a> which has been tested and used safely for many years. However if you really want to implement a simple deep freeze method yourself, it could look something like this:</p>\n<pre><code class=\"language-js\">const obj = {\n      name: &quot;Bob&quot;,\n      job: {\n        title : &quot;Worker&quot;\n        employees: {\n          &quot;Phil&quot;: {\n            title: &quot;Secretary&quot;\n          }\n        }\n      }\n   };\n\nfunction deepFreeze(obj){\n  if(typeof obj !== 'object') return; // escape condition... no more nesting is detected\n  Object.values(obj).forEach(deepFreeze) // recursively apply deepfreeze\n  Object.freeze(obj);\n}\n\ndeepFreeze(obj);\n\nobj.job.title = &quot;CEO&quot; // Will silently fail\nobj.job.employees.Phil.title = &quot;programmer&quot; // will silently fail\nconsole.log(obj.job.title) // &quot;Worker&quot;\nconsole.log(obj.job.employees.Phil.title) // &quot;secretary&quot;\n</code></pre>\n<h2>The Proposal for Records and Tuples</h2>\n<p>In TC39 (A committee overseeing feature additions to JS) there is a <a href=\"https://github.com/tc39/proposal-record-tuple\">proposal</a> to add two deeply immutable data types to the Javascript language: Records and Tuples. A record would essentially be a deeply immutable object and a tuple would essentially be a deeply immutable array.</p>\n<pre><code class=\"language-js\">#{ x: 1, y: 2 }; // Record\n#[1, 2, 3, 4]; // Tuple\n</code></pre>\n<p>These would be a welcome addition to Javascript in general and to the immutability toolkit in particular. It would remove the need for utility libraries like the deep-freeze library discussed above, and even mostly or entirely remove the need for <code>Object.freeze</code>, because now we would have deeply immutable object natively.</p>\n<h2>Cautionary Tale</h2>\n<p>I've run across a particularly hard to diagnose bug related to mutability in an application of mine. I was creating an array for a game board using <code>Array(10).fill({id: 0})</code>, with the intention that every space on the game board would have a unique object that I could update with game state. Unfortunately, when the <code>.fill</code> method is passed an object, it creates an array where every element is a reference to that same passed object in memory. So as I updated one space in the game state of the board (i.e. one position of that array), every space was mutated with that data, not just the one space I was targeting. It was a very weird bug that was hard to track at first, especially if you don't know about immutability and objects being passed by reference. So if you plan to try to use objects as independent state, you will want to go to the effort of copying the objects immutably and passing the copies around, and not the references. Thankfully with our immutability toolkit, we can now use our trusty <code>.map()</code> method to help us here:</p>\n<pre><code class=\"language-js\">Array(10)\n  .fill(0)\n  .map((item, index) =&gt; ({ id: index }));\n// this will create unique objects in each position of the array.\n</code></pre>\n<p>Using <code>.from()</code> is an alternative method to accomplish the same thing, because it accepts a callback function as the second argument to fill the values with. So you can pass a callback that returns an object, and each object will be a unique object in memory.</p>\n<pre><code class=\"language-js\">Array.from({ length: 10 }, (_, index) =&gt; ({ id: index }));\n// the second argument in the callback will be the index\n</code></pre>\n","ogImage":{"url":"/img/cover.jpg"},"coverImage":"/img/cover.jpg"}},"__N_SSG":true}